zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/spi.h
/**
 * \brief Component description for PIC32CZ/CA70 SPI
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ_CA70_SPI_COMPONENT_H_
#define _PIC32CZ_CA70_SPI_COMPONENT_H_

/** \addtogroup PIC32CZ_CA70_SPI Serial Peripheral Interface
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR SPI */
/* ========================================================================== */

/* -------- SPI_CR : (SPI Offset: 0x00) (/W 32) Control Register -------- */

typedef union
{
  struct
  {
    uint32_t SPIEN:1;                   /**< bit:      0  SPI Enable                                    */
    uint32_t SPIDIS:1;                  /**< bit:      1  SPI Disable                                   */
    uint32_t :5;                        /**< bit:   2..6  Reserved                                      */
    uint32_t SWRST:1;                   /**< bit:      7  SPI Software Reset                            */
    uint32_t :4;                        /**< bit:  8..11  Reserved                                      */
    uint32_t REQCLR:1;                  /**< bit:     12  Request to Clear the Comparison Trigger       */
    uint32_t :11;                       /**< bit: 13..23  Reserved                                      */
    uint32_t LASTXFER:1;                /**< bit:     24  Last Transfer                                 */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  uint32_t w;
} __SPI_CR_bits_t;

#define SPI_CR_SPIEN_Pos                      (0)                                            /**< (SPI_CR) SPI Enable Position */
#define SPI_CR_SPIEN_Msk                      (0x1U << SPI_CR_SPIEN_Pos)                     /**< (SPI_CR) SPI Enable Mask */
#define SPI_CR_SPIDIS_Pos                     (1)                                            /**< (SPI_CR) SPI Disable Position */
#define SPI_CR_SPIDIS_Msk                     (0x1U << SPI_CR_SPIDIS_Pos)                    /**< (SPI_CR) SPI Disable Mask */
#define SPI_CR_SWRST_Pos                      (7)                                            /**< (SPI_CR) SPI Software Reset Position */
#define SPI_CR_SWRST_Msk                      (0x1U << SPI_CR_SWRST_Pos)                     /**< (SPI_CR) SPI Software Reset Mask */
#define SPI_CR_REQCLR_Pos                     (12)                                           /**< (SPI_CR) Request to Clear the Comparison Trigger Position */
#define SPI_CR_REQCLR_Msk                     (0x1U << SPI_CR_REQCLR_Pos)                    /**< (SPI_CR) Request to Clear the Comparison Trigger Mask */
#define SPI_CR_LASTXFER_Pos                   (24)                                           /**< (SPI_CR) Last Transfer Position */
#define SPI_CR_LASTXFER_Msk                   (0x1U << SPI_CR_LASTXFER_Pos)                  /**< (SPI_CR) Last Transfer Mask */
#define SPI_CR_Msk                            (0x01001083UL)                                 /**< (SPI_CR) Register Mask  */

/* -------- SPI_MR : (SPI Offset: 0x04) (R/W 32) Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t MSTR:1;                    /**< bit:      0  Master/Slave Mode                             */
    uint32_t PS:1;                      /**< bit:      1  Peripheral Select                             */
    uint32_t PCSDEC:1;                  /**< bit:      2  Chip Select Decode                            */
    uint32_t :1;                        /**< bit:      3  Reserved                                      */
    uint32_t MODFDIS:1;                 /**< bit:      4  Mode Fault Detection                          */
    uint32_t WDRBT:1;                   /**< bit:      5  Wait Data Read Before Transfer                */
    uint32_t :1;                        /**< bit:      6  Reserved                                      */
    uint32_t LLB:1;                     /**< bit:      7  Local Loopback Enable                         */
    uint32_t :8;                        /**< bit:  8..15  Reserved                                      */
    uint32_t PCS:4;                     /**< bit: 16..19  Peripheral Chip Select                        */
    uint32_t :4;                        /**< bit: 20..23  Reserved                                      */
    uint32_t DLYBCS:8;                  /**< bit: 24..31  Delay Between Chip Selects                    */
  };
  uint32_t w;
} __SPI_MR_bits_t;

#define SPI_MR_MSTR_Pos                       (0)                                            /**< (SPI_MR) Master/Slave Mode Position */
#define SPI_MR_MSTR_Msk                       (0x1U << SPI_MR_MSTR_Pos)                      /**< (SPI_MR) Master/Slave Mode Mask */
#define SPI_MR_PS_Pos                         (1)                                            /**< (SPI_MR) Peripheral Select Position */
#define SPI_MR_PS_Msk                         (0x1U << SPI_MR_PS_Pos)                        /**< (SPI_MR) Peripheral Select Mask */
#define SPI_MR_PCSDEC_Pos                     (2)                                            /**< (SPI_MR) Chip Select Decode Position */
#define SPI_MR_PCSDEC_Msk                     (0x1U << SPI_MR_PCSDEC_Pos)                    /**< (SPI_MR) Chip Select Decode Mask */
#define SPI_MR_MODFDIS_Pos                    (4)                                            /**< (SPI_MR) Mode Fault Detection Position */
#define SPI_MR_MODFDIS_Msk                    (0x1U << SPI_MR_MODFDIS_Pos)                   /**< (SPI_MR) Mode Fault Detection Mask */
#define SPI_MR_WDRBT_Pos                      (5)                                            /**< (SPI_MR) Wait Data Read Before Transfer Position */
#define SPI_MR_WDRBT_Msk                      (0x1U << SPI_MR_WDRBT_Pos)                     /**< (SPI_MR) Wait Data Read Before Transfer Mask */
#define SPI_MR_LLB_Pos                        (7)                                            /**< (SPI_MR) Local Loopback Enable Position */
#define SPI_MR_LLB_Msk                        (0x1U << SPI_MR_LLB_Pos)                       /**< (SPI_MR) Local Loopback Enable Mask */
#define SPI_MR_PCS_Pos                        (16)                                           /**< (SPI_MR) Peripheral Chip Select Position */
#define SPI_MR_PCS_Msk                        (0xFU << SPI_MR_PCS_Pos)                       /**< (SPI_MR) Peripheral Chip Select Mask */
#define SPI_MR_PCS(value)                     (SPI_MR_PCS_Msk & ((value) << SPI_MR_PCS_Pos))
#define SPI_MR_DLYBCS_Pos                     (24)                                           /**< (SPI_MR) Delay Between Chip Selects Position */
#define SPI_MR_DLYBCS_Msk                     (0xFFU << SPI_MR_DLYBCS_Pos)                   /**< (SPI_MR) Delay Between Chip Selects Mask */
#define SPI_MR_DLYBCS(value)                  (SPI_MR_DLYBCS_Msk & ((value) << SPI_MR_DLYBCS_Pos))
#define SPI_MR_Msk                            (0xFF0F00B7UL)                                 /**< (SPI_MR) Register Mask  */

/* -------- SPI_RDR : (SPI Offset: 0x08) (R/ 32) Receive Data Register -------- */

typedef union
{
  struct
  {
    uint32_t RD:16;                     /**< bit:  0..15  Receive Data                                  */
    uint32_t PCS:4;                     /**< bit: 16..19  Peripheral Chip Select                        */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __SPI_RDR_bits_t;

#define SPI_RDR_RD_Pos                        (0)                                            /**< (SPI_RDR) Receive Data Position */
#define SPI_RDR_RD_Msk                        (0xFFFFU << SPI_RDR_RD_Pos)                    /**< (SPI_RDR) Receive Data Mask */
#define SPI_RDR_RD(value)                     (SPI_RDR_RD_Msk & ((value) << SPI_RDR_RD_Pos))
#define SPI_RDR_PCS_Pos                       (16)                                           /**< (SPI_RDR) Peripheral Chip Select Position */
#define SPI_RDR_PCS_Msk                       (0xFU << SPI_RDR_PCS_Pos)                      /**< (SPI_RDR) Peripheral Chip Select Mask */
#define SPI_RDR_PCS(value)                    (SPI_RDR_PCS_Msk & ((value) << SPI_RDR_PCS_Pos))
#define SPI_RDR_Msk                           (0x000FFFFFUL)                                 /**< (SPI_RDR) Register Mask  */

