zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/spi.h
/* -------- SPI_WPMR : (SPI Offset: 0xe4) (R/W 32) Write Protection Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t WPEN:1;                    /**< bit:      0  Write Protection Enable                       */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protection Key                          */
  };
  uint32_t w;
} __SPI_WPMR_bits_t;

#define SPI_WPMR_WPEN_Pos                     (0)                                            /**< (SPI_WPMR) Write Protection Enable Position */
#define SPI_WPMR_WPEN_Msk                     (0x1U << SPI_WPMR_WPEN_Pos)                    /**< (SPI_WPMR) Write Protection Enable Mask */
#define SPI_WPMR_WPKEY_Pos                    (8)                                            /**< (SPI_WPMR) Write Protection Key Position */
#define SPI_WPMR_WPKEY_Msk                    (0xFFFFFFU << SPI_WPMR_WPKEY_Pos)              /**< (SPI_WPMR) Write Protection Key Mask */
#define SPI_WPMR_WPKEY(value)                 (SPI_WPMR_WPKEY_Msk & ((value) << SPI_WPMR_WPKEY_Pos))
#define   SPI_WPMR_WPKEY_PASSWD_Val           (0x535049U)                                    /**< (SPI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define SPI_WPMR_WPKEY_PASSWD                 (SPI_WPMR_WPKEY_PASSWD_Val << SPI_WPMR_WPKEY_Pos)  /**< (SPI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define SPI_WPMR_Msk                          (0xFFFFFF01UL)                                 /**< (SPI_WPMR) Register Mask  */

/* -------- SPI_WPSR : (SPI Offset: 0xe8) (R/ 32) Write Protection Status Register -------- */

typedef union
{
  struct
  {
    uint32_t WPVS:1;                    /**< bit:      0  Write Protection Violation Status             */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPVSRC:8;                  /**< bit:  8..15  Write Protection Violation Source             */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __SPI_WPSR_bits_t;

#define SPI_WPSR_WPVS_Pos                     (0)                                            /**< (SPI_WPSR) Write Protection Violation Status Position */
#define SPI_WPSR_WPVS_Msk                     (0x1U << SPI_WPSR_WPVS_Pos)                    /**< (SPI_WPSR) Write Protection Violation Status Mask */
#define SPI_WPSR_WPVSRC_Pos                   (8)                                            /**< (SPI_WPSR) Write Protection Violation Source Position */
#define SPI_WPSR_WPVSRC_Msk                   (0xFFU << SPI_WPSR_WPVSRC_Pos)                 /**< (SPI_WPSR) Write Protection Violation Source Mask */
#define SPI_WPSR_WPVSRC(value)                (SPI_WPSR_WPVSRC_Msk & ((value) << SPI_WPSR_WPVSRC_Pos))
#define SPI_WPSR_Msk                          (0x0000FF01UL)                                 /**< (SPI_WPSR) Register Mask  */

/** \brief SPI register offsets definitions */
#define SPI_CR_OFFSET                (0x00)         /**< (SPI_CR) Control Register Offset */
#define SPI_MR_OFFSET                (0x04)         /**< (SPI_MR) Mode Register Offset */
#define SPI_RDR_OFFSET               (0x08)         /**< (SPI_RDR) Receive Data Register Offset */
#define SPI_TDR_OFFSET               (0x0C)         /**< (SPI_TDR) Transmit Data Register Offset */
#define SPI_SR_OFFSET                (0x10)         /**< (SPI_SR) Status Register Offset */
#define SPI_IER_OFFSET               (0x14)         /**< (SPI_IER) Interrupt Enable Register Offset */
#define SPI_IDR_OFFSET               (0x18)         /**< (SPI_IDR) Interrupt Disable Register Offset */
#define SPI_IMR_OFFSET               (0x1C)         /**< (SPI_IMR) Interrupt Mask Register Offset */
#define SPI_CSR_OFFSET               (0x30)         /**< (SPI_CSR) Chip Select Register (CS_number = 0) 0 Offset */
#define SPI_WPMR_OFFSET              (0xE4)         /**< (SPI_WPMR) Write Protection Mode Register Offset */
#define SPI_WPSR_OFFSET              (0xE8)         /**< (SPI_WPSR) Write Protection Status Register Offset */

/** \brief SPI register API structure */
typedef struct
{
  __O   __SPI_CR_bits_t                SPI_CR;        /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  __SPI_MR_bits_t                SPI_MR;        /**< Offset: 0x04 (R/W  32) Mode Register */
  __I   __SPI_RDR_bits_t               SPI_RDR;       /**< Offset: 0x08 (R/   32) Receive Data Register */
  __O   __SPI_TDR_bits_t               SPI_TDR;       /**< Offset: 0x0C ( /W  32) Transmit Data Register */
  __I   __SPI_SR_bits_t                SPI_SR;        /**< Offset: 0x10 (R/   32) Status Register */
  __O   __SPI_IER_bits_t               SPI_IER;       /**< Offset: 0x14 ( /W  32) Interrupt Enable Register */
  __O   __SPI_IDR_bits_t               SPI_IDR;       /**< Offset: 0x18 ( /W  32) Interrupt Disable Register */
  __I   __SPI_IMR_bits_t               SPI_IMR;       /**< Offset: 0x1C (R/   32) Interrupt Mask Register */
  __I   uint8_t                        Reserved1[0x10];
  __IO  __SPI_CSR_bits_t               SPI_CSR[4];    /**< Offset: 0x30 (R/W  32) Chip Select Register (CS_number = 0) 0 */
  __I   uint8_t                        Reserved2[0xA4];
  __IO  __SPI_WPMR_bits_t              SPI_WPMR;      /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   __SPI_WPSR_bits_t              SPI_WPSR;      /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
} spi_registers_t;
/** @}  end of Serial Peripheral Interface */

#endif /* _PIC32CZ_CA70_SPI_COMPONENT_H_ */
